export const descArrDouzone: descArr[] = [
  {
    descTitle: "[Self 연말정산 서비스]",
    descSubTitle:
      "목표: 수임기업들의 고객들이 편리하고 쉽게 연말정산을 진행할 수 있도록 도와주는 연말정산 시스템을 구축",
    desc:
      "연말정산 진행 프로세스중 자료입력 단계와 결과 미리보기 단계의 UI를 개발 하였습니다." +
      "입사 후 처음 진행한 대규모 프로젝트 였으나, 적절하고 능동적인 협업으로 이상없이 결과물을 도출 하였습니다. ",
  },
  {
    descTitle: "[세무리스크 자동검증]",
    descSubTitle:
      "목표: 세무사들이 공단에 각종 신고를 하기전, 해당 신고 자료의 이상 여부를 자동검증 하여 오류 내용을 알려주는 서비스 개발.",
    desc:
      "해당 웹 서비스의 프론트엔드 개발을 전적으로 담당하였습니다.\n" +
      "타 메뉴에 비하여 유저 사용량 대비 현저히 적은 오류가 발생하였습니다.",
  },
  {
    descTitle: "[세무법인 자금일보]",
    descSubTitle: "목표: 세무법인 본점과 지점사들의 각종 회계 세무 데이터를 한눈에 볼 수 있는 메뉴 제작.",
    desc:
      "해당 웹 서비스의 프론트엔드 개발을 전적으로 담당하였습니다.\n" +
      "리얼 그리드사의 그리드 시스템과 웹 테이블 차트를 데이터와 상황에 맞게 동적으로 표기하는 로직을 구성하였습니다." +
      "특정 세무법인사의 요청으로 고객이 요구한 사항들을 모두 구현하였고 이후 오류접수는 없었습니다.",
  },
  {
    descTitle: "[서비스모듈 다국어화]",
    descSubTitle:
      "목표: 회계 모듈과 급여 모듈의 일본 서비스를 위해 각각 메뉴내 고정 텍스트들을 동적으로 표기할 수 있도록 변경.",
    desc:
      "담당 서비스 메뉴들의 텍스트들이 가지고 있는 고유 스타일들을 그대로 유지 하면서 추후 쉽게 유지보수가 가능하도록 구조 정리 하였습니다." +
      "웹브라우저 언어에 따라 웹페이지가 각각 한국어 / 일본어 / 영어 3개의 다른 언어로 표기 되도록 처리하였습니다.",
  },
];
